spec/fixtures/accounts/subscriptions/index-200.xml

HTTP/1.1 201 Created
Content-Type: application/xml; charset=utf-8
Location: https://api.recurly.com/v2/accounts/abcdef1234567890/subscriptions.xml

<?xml version="1.0" encoding="UTF-8"?>
<subscriptions type="array">
  <subscription href="https://api.recurly.com/v2/subscriptions/2ad6a72fd96eaee2b26f1542819a4206">
    <account href="https://api.recurly.com/v2/accounts/abcdef1234567890" />
    <invoice href="https://api.recurly.com/v2/invoices/1000" />
    <plan href="https://api.recurly.com/v2/plans/basic">
    <plan_code>basic</plan_code>
      <name>Basic Plan</name>
    </plan>
    <uuid>2ad6a72fd96eaee2b26f1542819a4206</uuid>
    <state>active</state>
    <unit_amount_in_cents type="integer">1000</unit_amount_in_cents>
    <currency>USD</currency>
    <quantity type="integer">1</quantity>
    <activated_at type="datetime">2014-10-31T20:18:27Z</activated_at>
    <canceled_at nil="nil" />
    <expires_at nil="nil" />
    <total_billing_cycles nil="nil" />
    <remaining_billing_cycles nil="nil" />
    <current_period_started_at type="datetime">2014-10-31T20:18:27Z</current_period_started_at>
    <current_period_ends_at type="datetime">2014-11-30T20:18:27Z</current_period_ends_at>
    <trial_started_at nil="nil" />
    <trial_ends_at nil="nil" />
    <subscription_add_ons type="array"></subscription_add_ons>
    <a name="cancel" href="https://api.recurly.com/v2/subscriptions/2ad6a72fd96eaee2b26f1542819a4206/cancel" method="put" />
    <a name="terminate" href="https://api.recurly.com/v2/subscriptions/2ad6a72fd96eaee2b26f1542819a4206/terminate" method="put" />
    <a name="postpone" href="https://api.recurly.com/v2/subscriptions/2ad6a72fd96eaee2b26f1542819a4206/postpone" method="put" />
  </subscription>
</subscriptions>
